---
kind: type
id: T:Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry
source: html/bacd9a66-45b9-f06a-eaa1-7f93f6660b53.htm
---
# Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry

An object that stores IExtElemChangeBeamSection

## Syntax (C#)
```csharp
public class ExtElemChangeBeamSectionRegistry : IDisposable
```